# Antidote Plugin Configuration
# https://antidote.sh/

# Foundation (load first)
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib

# OMZ Core Plugins - Immediate loading
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/z
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/encode64

# OMZ Dev Tool Plugins - Deferred for faster startup
ohmyzsh/ohmyzsh path:plugins/gh kind:defer
ohmyzsh/ohmyzsh path:plugins/dotnet kind:defer

# External Plugins (syntax-highlighting MUST be last before theme)
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting

# Theme
romkatv/powerlevel10k
